/* 
    나쁜 코드 종류

    - 기이한 이름: 코드 이해력, 가독성 x
    
    - 중복 코드: 실수와 에러 발생한 확률 증가

    - 긴 함수: 이해하기 어렵고 재사용성이 떨어진다.

    - 긴 매개변수 목록: 사용하기 어렵다.

    - 전역 데이터: 예상하지 못한 에러

    - 가변 데이터: 예상하지 못한 데이터 변경

    - 뒤엉킨 변경: 한 모듈에서 여러가지 작업

    - 산탄총 수술: 한 모듈이 여러가지 모듈과 엮어있는 경우

    - 기능 편애: 다른 모듈과 밀접하게 상호 작용

    - 데이터 뭉치: 여러곳에서 항상 함께 쓰임

    - 기본형 집착: 관련된 코드가 여기저기있는 경우

    - 반복되는 switch문: 새로운 타입이 추가되면 여기저기서 업데이트 해야 함

    - 추측성 일반화: 혹시 모르니 미래를 위해서 작성

    - 임시필드: 특정한 상황에서만 사용된다.

    - 거대한 클래스

    - 내부자 거래: 모듈사이 데이터 거래가 많아지면 모듈 간 결합도가 상승

    - 주석: 필요없는 주석 남용

*/
